# Imersão pandas

SqlAlchemy é uma biblioteca de ORM

- Conexão fácil 
- Mapeamento de Tabela com Classe (ORM)
- Resolve um comflito de tecnologias com paradígmas diferentes.
- Tudo fique orientado a objetos

In [2]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

In [4]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ead\desktop\projetomanha\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [6]:
! pip install pymysql

Collecting pymysql
  Using cached PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Using cached PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [2]:
import pandas as pd

In [3]:
from sqlalchemy import create_engine

In [4]:
import pymysql

Senha?

- password: senai@123

In [29]:
# biblioteca para converter e resolver o problema do @ na senha 
import urllib.parse

# Qual o usuario e a senha do banco?

user = 'root'

#password = ''

# password = 'root'
password = urllib.parse.quote_plus('senai@123')

# Qual o host do banco?

host = 'localhost'

database = 'projetodiario'

# Connection_string : string com TODAS as informações da conexão 
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# criando a conexão
engine = create_engine(connection_string)

# Escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno"
query_diario = "SELECT * FROM diariobordo"
query_avaliacao = "SELECT * FROM avaliacao"

# Criar um dataframe com a consulta SQL
df_alunos = pd.read_sql(query_alunos,engine)
df_diario = pd.read_sql(query_diario,engine)
df_avaliacao = pd.read_sql(query_avaliacao,engine)

df_alunos

    id        ra  nome  tempoestudo rendafamiliar
0    1  12345678  None            0          None
1    2  12345670  None            0          None
2    3  12345671  None            0          None
3    4  12345672  None            0          None
4    5  12345673  None            0          None
5    6  12345674  None            0          None
6    7  12345675  None            0          None
7    8  12345676  None            0          None
8    9  12345677  None            0          None
9   10  12345679  None            0          None
10  11  12345680  None            0          None
11  12  12345681  None            0          None
12  13  12345682  None            0          None
13  14  12345683  None            0          None
14  15  12345684  None            0          None
15  16  12345685  None            0          None
16  17  12345686  None            0          None
17  18  12345687  None            0          None
18  19  12345688  None            0          None
19  20  12345689  None            0          None
20  21  12345690  None            0          None
21  22  12345691  None            0          None
22  23  12345692  None            0          None
23  24  12345693  None            0          None
24  25  12345694  None            0          None

## Bilioteca para Data Science
- pandas (EDA - Analise exploratoria de dados)
- SciktLean (Fundamentos de Inteligencia Artificial)
- NumPy (atemãtica complexa com abstração)

Salvando o DataFrame

- .csv
- .xlsx
- .jason
- .sql
- .html
- .xml

In [6]:
csv_filename = "alunos.csv"
df_alunos.to_csv(csv_filename,index=False)

# Crie uma nova celula que salve o dataframe no formato .json

In [7]:
json_filename = "alunos.json"
df_alunos.to_json(json_filename,index=False)

# Um novo DataFrame

In [8]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

### Exerccicio: Como mostrar os registros do DataFrame usando fatiamento

In [10]:
len(df_alunos)

25

In [14]:
df_alunos[5:15]

    id        ra  nome  tempoestudo rendafamiliar
5    6  12345674  None            0          None
6    7  12345675  None            0          None
7    8  12345676  None            0          None
8    9  12345677  None            0          None
9   10  12345679  None            0          None
10  11  12345680  None            0          None
11  12  12345681  None            0          None
12  13  12345682  None            0          None
13  14  12345683  None            0          None
14  15  12345684  None            0          None

### Crie uma series apenas com a renda familiar

In [16]:
renda_familiar = df_alunos['rendafamiliar']
type(renda_familiar)

pandas.core.series.Series

In [17]:
renda_familiar

0     None
1     None
2     None
3     None
4     None
5     None
6     None
7     None
8     None
9     None
10    None
11    None
12    None
13    None
14    None
15    None
16    None
17    None
18    None
19    None
20    None
21    None
22    None
23    None
24    None
Name: rendafamiliar, dtype: object

### Funções basicas

- Retorne as duas primeiras linhas de um DataFrame

In [20]:
df_alunos[0:2]

   id        ra  nome  tempoestudo rendafamiliar
0   1  12345678  None            0          None
1   2  12345670  None            0          None

outro metodo de realizar a atividade

In [21]:
df_alunos.head(2)

   id        ra  nome  tempoestudo rendafamiliar
0   1  12345678  None            0          None
1   2  12345670  None            0          None

In [22]:
df_alunos.iloc[2]

id                      3
ra               12345671
nome                 None
tempoestudo             0
rendafamiliar        None
Name: 2, dtype: object

In [23]:
df_alunos [53:55]

Empty DataFrame
Columns: [id, ra, nome, tempoestudo, rendafamiliar]
Index: []

In [24]:
df_alunos.describe()

              id  tempoestudo
count  25.000000         25.0
mean   13.000000          0.0
std     7.359801          0.0
min     1.000000          0.0
25%     7.000000          0.0
50%    13.000000          0.0
75%    19.000000          0.0
max    25.000000          0.0

In [28]:
df_diario.describe()

             id                       datahora  fk_aluno_id
count  7.000000                              7     7.000000
mean   4.000000  2024-08-04 12:24:17.142857216    14.857143
min    1.000000            2024-08-01 10:45:00    13.000000
25%    2.500000            2024-08-03 00:45:00    14.000000
50%    4.000000            2024-08-04 13:15:00    15.000000
75%    5.500000            2024-08-06 00:40:00    15.500000
max    7.000000            2024-08-07 12:00:00    17.000000
std    2.160247                            NaN     1.345185

In [30]:
df_avaliacao.describe()

             id     nota1      nota2  nota3      nota4  fk_aluno_id
count  5.000000   5.00000   5.000000    5.0   5.000000      5.00000
mean   3.000000  21.00000  18.600000   18.0  16.600000      5.20000
std    1.581139   2.44949   5.458938    2.0   9.370165      3.49285
min    1.000000  18.00000  10.000000   16.0   0.000000      1.00000
25%    2.000000  20.00000  18.000000   16.0  20.000000      3.00000
50%    3.000000  20.00000  20.000000   18.0  20.000000      5.00000
75%    4.000000  23.00000  20.000000   20.0  20.000000      7.00000
max    5.000000  24.00000  25.000000   20.0  23.000000     10.00000